Main_Loop_Codes/constant/polyMesh/blockMeshDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


convertToMeters 1;

vertices
(
    (-5 -1 0)
    (10 -1 0)
    (10  1 0)
    (-5  1 0)
    (-5 -1 5)
    (10 -1 5)
    (10  1 5)
    (-5  1 5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (18 4 8) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch frontAndBack
    (
        (3 7 6 2)
        (1 5 4 0)
    )
    patch inlet
    (
        (0 4 7 3)
    )
    patch outlet
    (
        (2 6 5 1)
    )
    wall lowerWall
    (
        (0 3 2 1)
    )
    patch upperWall
    (
        (4 5 6 7)
    )
);

// ************************************************************************* //
